doc/nix.org
#+TITLE: Nix Setup and Usage
#+LINK: cachix https://cachix.org
#+LINK: nix-env https://nixos.org/nix/manual/#sec-nix-env
#+LINK: nix-expr https://nixos.org/nix/manual/#ch-expression-language
#+LINK: nix https://nixos.org/nix
#+LINK: nix-install https://nixos.org/nix/manual/#chap-installation
#+LINK: nix-learn https://nixos.org/learn.html
#+LINK: nix-manual https://nixos.org/nix/manual
#+LINK: nix-tutorial https://github.com/shajra/example-nix/tree/master/tutorials/0-nix-intro
#+LINK: nixpkgs https://github.com/NixOS/nixpkgs
#+LINK: nixpkgs-manual https://nixos.org/nixpkgs/manual

* Org-mode Setup :noexport:

  This document is written in a project-agnostic way so it can be copied to
  other projects using Nix.

** Variables

   These are some references that need to be changed to use this document in
   other projects.

   #+MACRO: get (eval (concat $2 (alist-get '$1 (car (read-from-string (f-read "nix.org.el")))) $2))
   #+MACRO: package-attr {{{get(package-attr, "\"")}}}
   #+MACRO: package-name {{{get(package-name, "\"")}}}
   #+MACRO: package-exe {{{get(package-exe, "=")}}}

   #+NAME: get
   #+BEGIN_SRC emacs-lisp :var arg="" :eval yes :results silent
     (alist-get (intern arg) (car (read-from-string (f-read "nix.org.el"))))
   #+END_SRC

** Formatting help

   This snippet is used to crop down results of evaluating source code blocks
   as a post-processing step.

   #+NAME: crop
   #+BEGIN_SRC emacs-lisp :var text="" :var first-n=5 :var last-n=5 :results silent
     (let* ((ls         (split-string text "\n"))
            (first-ls   (-take first-n ls))
            (rest-first (-drop first-n ls))
            (rest-last  (-drop-last (+ 1 last-n) rest-first))
            (last-ls    (-take-last (+ 1 last-n) rest-first)))
       (string-join
        (if rest-last
            (append first-ls '("…") last-ls)
          (append first-ls last-ls))
        "\n"))
   #+END_SRC

** Setup action

   #+NAME: cleanup
   #+BEGIN_SRC shell :dir .. :results output silent
     rm -rf result* || true
     rm -rf nix-profile || true
   #+END_SRC

* How this project uses Nix

  This project uses the [[nix][Nix package manager]] to download all necessary
  dependencies and build everything from source.

  Because Nix is more than a build system, notably a full package manager, the
  final build is actually a Nix package that you can install with the Nix
  package manager if you like.

  Builds from this project are cached at [[cachix][Cachix]], a service that caches
  pre-built Nix packages. If you don't want to wait for a full local build,
  setting up Cachix is recommended.

  The various files with a ".nix" extension are Nix files, each of which
  contains an expression written in the [[nix-expr][Nix expression language]] used by the Nix
  package manager. If you get proficient with this language, you can compose
  expressions together to make your own packages from others (if that's useful
  to you).

* Motivation to use Nix

  When making a new software project, wrangling dependencies can be a chore.
  For instance, GNU Make's makefiles often depend on executables and libraries
  that may or may not be on a system. The makefiles in most projects don't
  assist with getting these dependencies at usable versions. And many projects
  just provide error-prone instructions for how to get and install these
  dependencies manually.

  Nix can build and install projects in a way that's precise, repeatable, and
  guaranteed not to conflict with anything already installed. Nix can even
  concurrently provide multiple versions of any package without conflicts.

  Furthermore, Nix supports building for a variety of languages. In many cases,
  Nix picks up where language-specific tooling stop, layering on top of the
  tools and techniques native to those ecosystems. Nix expressions are designed
  for composition, which helps integrate packages from dependencies that may
  not all come from the same language ecosystem. These dependencies in Nix are
  themselves Nix packages.

  To underscore how repeatable and precise Nix builds are, it helps to know
  that Nix uniquely identifies packages by a hash derived from the hashes of
  requisite dependencies and configuration. This is a recursive hash
  calculation that assures that the smallest change to even a distant
  transitive dependency changes the hash. When dependencies are downloaded,
  they are checked against the expected hash. Most Nix projects (this one
  included) are careful to pin dependencies to specific versions/hashes.
  Because of this, when building the same project with Nix on two different
  systems, we get an extremely high confidence we will get the same output,
  often bit-for-bit. This is a profound degree of precision relative to other
  popular package managers.

  The repeatability and precision of Nix enables caching services, which for
  Nix are called /substituters/. Cachix is one such substituter. Before
  building a package, the hash for the package is calculated. If any configured
  substituter has a build for the hash, it's pulled down as a substitute. A
  certificate-based protocol is used to establish trust of substituters.
  Between this protocol, and the algorithm for calculating hashes in Nix, you
  can have confidence that a package pulled from a substituter will be
  identical to what you would have built locally.

  All of this makes Nix an attractive tool for managing almost any software
  project.

* Installation and Setup
** Nix package manager setup

   #+BEGIN_QUOTE
   *_NOTE:_* You don't need this step if you're running NixOS, which comes with
   Nix baked in.
   #+END_QUOTE

   If you don't already have Nix, the official installation script should work
   on a variety of UNIX-like operating systems. The easiest way to run this
   installation script is to execute the following shell command as a user
   other than root:

   #+BEGIN_SRC shell :eval no
     curl https://nixos.org/nix/install | sh
   #+END_SRC

   This script will download a distribution-independent binary tarball
   containing Nix and its dependencies, and unpack it in =/nix=.

   The Nix manual describes [[nix-install][other methods of installing Nix]] that may suit you
   more.

** Cache setup

   It's recommended to configure Nix to use shajra.cachix.org as a Nix
   /substituter/. This project pushes built Nix packages to [[cachix][Cachix]] as part of
   its continuous integration. Once configured, Nix will pull down these
   pre-built packages instead of building them locally.

   You can configure shajra.cachix.org as a substituter with the following
   command:

   #+BEGIN_SRC shell :eval no
     nix run \
         --file https://cachix.org/api/v1/install \
         cachix \
         --command cachix use shajra
   #+END_SRC

   This will perform user-local configuration of Nix at
   =~/.config/nix/nix.conf=. This configuration will be available immediately,
   and any subsequent invocation of Nix commands will take advantage of the
   Cachix cache.

   If you're running NixOS, you can configure Cachix globally by running the
   above command as a root user. The command will then configure
   =/etc/nixos/cachix/shajra.nix=, and the output will explain how to tie this
   configuration into your normal NixOS configuration.

* Working with Nix

  Though covering Nix comprehensively is beyond the scope of this document,
  we'll go over a few commands illustrating using Nix with this project.

