doc/nix.md

## Searching Nix files<a id="sec-4-1"></a>

Each of the Nix files in this project (ones with a ".nix" extension) contains exactly one Nix expression. This expression evaluates to one of the following values:

-   simple primitives and functions
-   derivations of packages that can be built and installed with Nix
-   containers of values, allowing a single value to provide more than one thing (these containers can nest).

Once you learn the Nix language, you can read these files to see what kind of values they build. We can use the `nix search` command to see what package derivations a Nix expression contains. For example from the top-level of this project, we can execute:

```shell
nix search --file default.nix --no-cache
```

    * nix-project-lib.lib-sh (lib.sh)
      Common shell functions
    
    * shajra-keyboards-flash-scripts.ergodoxez (flash-ergodoxez)
      Flash ZSA Technology Lab's Ergodox EZ Keyboard
    
    * shajra-keyboards-flash-scripts.model01 (flash-model01)
      Flash Keyboardio's Model 01 Keyboard
    
    …

If you don't get the results above, see the [section on understanding derivations](#nix-drv) for an explanation of the likely problem and a workaround.

Note that because for extremely large Nix expressions, searching can be slow, `nix search` by defaults uses an indexed cache. This cache can be explicitly updated. However, because small local projects rarely have that many package derivations, the `--no-cache` switch is used above to bypass the cache. This guarantees accurate results that are fast enough. Otherwise, you will only get hits for the last Nix expression cached, which may be surprising.

The output of `nix search` is formatted as

    * attribute-name (name-of-package)
      Short description of package

*Attribute names* are used to select values from a Nix set containing multiple package derivations. If the Nix expression evaluates to a single derivation (not in a container), the attribute name will be missing from the `nix search` result.

Many Nix commands evaluate Nix files. If you specify a directory instead, the command will look for a `default.nix` file within to evaluate. So from the top-level of this project, we could use `.` instead of `default.nix`:

```shell
nix search --file . --no-cache
```

In the remainder of this document, we'll use `.` instead of `default.nix` since this is conventional for Nix.

## Building Nix expressions<a id="sec-4-2"></a>

From our execution of `nix search` we can see that a package named "flash-ergodoxez" can be accessed with the "shajra-keyboards-flash-scripts.ergodoxez" attribute name in the Nix expression in the top-level `default.nix`.

We can build this package with `nix build` from the top-level:

```shell
nix build --file . shajra-keyboards-flash-scripts.ergodoxez
```

The positional arguments to `nix build` are attribute names. If you supply none then all attributes are built by default.

All packages built by Nix are stored in `/nix/store`. Nix won't rebuild packages found there. Once a package is built, its directory in `/nix/store` is read-only (until the package is deleted).

After a successful call of `nix build`, you'll see some symlinks for each package requested in the current working directory. These symlinks by default have a name prefixed with "result" and point back to the respective build in `/nix/store`:

```shell
readlink result*
```

    /nix/store/v9wvxg6j8p4lj0cl56k4rdb65r5n887h-flash-ergodoxez

Following these symlinks, we can see the files the project provides:

```shell
tree -l result*
```

    result
    └── bin
        └── flash-ergodoxez
    
    1 directory, 1 file

It's common to configure these "result" symlinks as ignored in source control tools (for instance, within a Git `.gitignore` file).

`nix build` has a `--no-link` switch in case you want to build packages without creating "result" symlinks. To get the paths where your packages are located, you can use `nix path-info` after a successful build:

```shell
nix path-info --file . shajra-keyboards-flash-scripts.ergodoxez
```

    /nix/store/v9wvxg6j8p4lj0cl56k4rdb65r5n887h-flash-ergodoxez

## Running commands<a id="sec-4-3"></a>

You can run a command from a package in a Nix expression with `nix run`. For instance, to get the help message for the `flash-ergodoxez` executable provided by the "flash-ergodoxez" package selected by the "shajra-keyboards-flash-scripts.ergodoxez" attribute name, we can call the following:

```shell
nix run \
    --file . \
    shajra-keyboards-flash-scripts.ergodoxez \
    --command flash-ergodoxez --help
```

    USAGE: flash-ergodoxez [OPTION]...
    
    DESCRIPTION:
    
        Flashes ZSA Technology Lab's Ergodox EZ Keyboard
    …

You don't even have to build the package first with `nix build` or mess around with the "result" symlinks. `nix run` will build the project if it's not yet been built.

Again, as with `nix build` attribute names are specified as positional arguments to select packages.

The command to run is specified after the `--command` switch. `nix run` runs the command in a shell set up with a `PATH` environment variable including all the `bin` directories provided by the selected packages.

`nix run` also supports an `--ignore-environment` flag that restricts `PATH` to only packages selected, rather than extending the `PATH` of the outside environment. With `--ignore-environment`, the invocation is more sandboxed.
