doc/nix.md

## Installing and uninstalling programs<a id="sec-4-4"></a>

We've seen that we can build programs with `nix build` and then execute programs using the "result" symlink (`result/bin/*`). Additionally, we've seen that you can run programs with `nix run`. But these additional steps and switches/arguments can feel extraneous. It would be nice if we could just have the programs on our `PATH`. This is what `nix-env` is for.

`nix-env` maintains a symlink tree, called a *profile*, of installed programs. The active profile is pointed to by a symlink at `~/.nix-profile`. By default, this profile points to `/nix/var/nix/profiles/per-user/$USER/profile`. But you can point your `~/.nix-profile` to any writable location with the `--switch-profile` switch:

```shell
nix-env --switch-profile /nix/var/nix/profiles/per-user/$USER/another-profile
```

This way, you can just put `~/.nix-profile/bin` on your `PATH`, and any programs installed in your currently active profile will be available for interactive use or scripts.

We can query what's installed in the active profile with the `--query` switch:

```shell
nix-env --query
```

To install the `flash-ergodoxez` executable, which is accessed by the "shajra-keyboards-flash-scripts.ergodoxez" in our top-level `default.nix` file, we'd run the following:

```shell
nix-env --install --file . --attr shajra-keyboards-flash-scripts.ergodoxez 2>&1
```

    installing 'flash-ergodoxez'

We can see this installation by querying what's been installed:

```shell
nix-env --query
```

    flash-ergodoxez

And if we want to uninstall a program from our active profile, we do so by its name, in this case "flash-ergodoxez":

```shell
nix-env --uninstall flash-ergodoxez 2>&1
```

    uninstalling 'flash-ergodoxez'

Note that we've installed our package using its attribute name ("shajra-keyboards-flash-scripts.ergodoxez") within the referenced Nix expression. But we uninstall it using the package name ("flash-ergodoxez"), which may or may not be the same as the attribute name. When a package is installed, Nix keeps no reference to the expression that evaluated to the derivation of the installed package. The attribute name is only relevant to this expression. In fact, two different expressions could evaluate to the exact same derivation, but use different attribute names. This is why we uninstall packages by their package name.

See the [documentation for `nix-env`](https://nixos.org/nix/manual/#sec-nix-env) for more details.

## Garbage collection<a id="sec-4-5"></a>

Old versions of packages stick around in `/nix/store`. We can clean this up with garbage collection by calling `nix-collect-garbage`.

For each package, Nix is aware of all references back to `/nix/store` for other packages, whether in text files or binaries. This allows Nix to prevent the deletion of a runtime dependency required by another package.

Symlinks pointing to packages to exclude from garbage collection are maintained by Nix in `/nix/var/nix/gcroots`. Looking closer, you'll see that for each "result" symlink created by a `nix build` invocation, there's symlinks in `/nix/var/nix/gcroots/auto` pointing back it. So we've got symlinks in `/nix/var/nix/gcroots/auto` pointing to "result" symlinks in our projects, which then reference the actual built project in `/nix/store`.

These symlinks prevent packages built by `nix build` from being garbage collected. If you want a package you've built with `nix build` to be garbage collected, delete the "result" symlink created before calling `nix-collect-garbage`. Breaking symlinks under `/nix/var/nix/gcroots` removes protection from garbage collection. `nix-collect-garbage` will cleans up broken symlinks when it runs.

Also, it's good to know that `nix-collect-garbage` won't delete packages referenced by any running processes. In the case of `nix run` no garbage collection root symlink is created under `/nix/var/nix/gcroots`, but while `nix run` is running a `nix-collect-garbage` won't delete packages needed by the invocation. However, once the `nix run` call exits, any packages pulled from a substituter or built locally are candidates for deletion by `nix-collect-garbage`. If you called `nix run` again after garbage collecting, those packages might be pulled or built again.

## Understanding derivations<a id="nix-drv"></a>

We haven't detailed what happens when we build a Nix expression that evaluates to a package derivation. There are two important steps:

1.  *instantiating* the derivation
2.  *realizing* the instantiated derivation, which builds the final package.

An instantiated derivation is effectively a script stored in `/nix/store` that Nix can run to build the final package (which also ends up in `/nix/store`). These instantiated derivations have a ".drv" extension, and if you look in `/nix/store` you may find some. Instantiated derivations have references to all necessary build dependencies, also in `/nix/store`, which means that everything is physically in place in `/nix/store` to build the package. No further evaluation of a Nix expression is needed once we have an instantiated derivation to build the final package. Note that both `nix build` and `nix run` perform both instantiation and realization of a derivation, so for the most part, we don't have to worry about the difference between instantiating and realizing a derivation.

However, you may encounter a Nix expression where `nix search` returns nothing, though you're sure that there are derivations to select out. In this case, the Nix expression is using an advanced technique that unfortunately hides attributes from `nix search` until some derivations are instantiated into `/nix/store`. We can force the instantiation of these derivations without realizing their packages with the following command:

```shell
nix show-derivation --file default.nix
```

Once these derivations are instantiated, you may get more results with `nix search` for the occasional Nix expression that uses some advanced techniques.

## Lazy evaluation<a id="sec-4-7"></a>

We haven't made a big deal of it, but the Nix language is *lazily evaluated*. This allows a single Nix expression to refer to several thousand packages, but without requiring us to evaluate everything when selecting out packages by attribute names. In fact, the entire NixOS operating system is based heavily on a single single expression managed in a Git repository called [Nixpkgs](https://github.com/NixOS/nixpkgs).

# Next Steps<a id="sec-5"></a>

This document has covered a fraction of Nix usage, hopefully enough to introduce Nix in the context of [this project](../README.md).

An obvious place to start learn more about Nix is [the official documentation](https://nixos.org/learn.html). The author of this project also maintains another project with [a small tutorial on Nix](https://github.com/shajra/example-nix/tree/master/tutorials/0-nix-intro). This tutorial covers the Nix expression language in more detail.

All the commands we've covered have more switches and options. See the respective man-pages for more. Also, we didn't cover `nix-shell`, which can be used for setting up development environments. And we didn't cover much of [Nixpkgs](https://github.com/NixOS/nixpkgs), the gigantic repository of community-curated Nix expressions.

The Nix ecosystem is vast. This project and documentation illustrates just a small example of what Nix can do.
